tiborsimon/embedded-tdd-headers/pic/pic16/pic16f1939_tdd.h
#define SSPM1                         522
#define SSPM2                         523
#define SSPM3                         524
#define CKP                           525
#define SSPEN                         526
#define SSPOV                         527
#define WCOL                          528
#define SSPCON2                       529
#define SEN                           530
#define RSEN                          531
#define PEN                           532
#define RCEN                          533
#define ACKEN                         534
#define ACKDT                         535
#define ACKSTAT                       536
#define GCEN                          537
#define SSPCON3                       538
#define DHEN                          539
#define AHEN                          540
#define SBCDE                         541
#define SDAHT                         542
#define BOEN                          543
#define SCIE                          544
#define PCIE                          545
#define ACKTIM                        546
#define CCPR1L                        547
#define CCPR1H                        548
#define CCP1CON                       549
#define CCP1M0                        550
#define CCP1M                         551
#define CCP1M1                        552
#define CCP1M2                        553
#define CCP1M3                        554
#define DC1B                          555
#define DC1B0                         556
#define DC1B1                         557
#define P1M                           558
#define P1M0                          559
#define P1M1                          560
#define PWM1CON                       561
#define P1DC0                         562
#define P1DC1                         563
#define P1DC2                         564
#define P1DC3                         565
#define P1DC4                         566
#define P1DC5                         567
#define P1DC6                         568
#define P1RSEN                        569
#define CCP1AS                        570
#define PSS1BD0                       571
#define PSS1BD1                       572
#define PSS1AC0                       573
#define PSS1AC1                       574
#define CCP1AS0                       575
#define CCP1AS1                       576
#define CCP1AS2                       577
#define CCP1ASE                       578
#define PSTR1CON                      579
#define STR1A                         580
#define STR1B                         581
#define STR1C                         582
#define STR1D                         583
#define STR1SYNC                      584
#define CCPR2L                        585
#define CCPR2H                        586
#define CCP2CON                       587
#define CCP2M                         588
#define CCP2M0                        589
#define CCP2M1                        590
#define CCP2M2                        591
#define CCP2M3                        592
#define DC2B                          593
#define DC2B0                         594
#define DC2B1                         595
#define P2M                           596
#define P2M0                          597
#define P2M1                          598
#define PWM2CON                       599
#define P2DC0                         600
#define P2DC1                         601
#define P2DC2                         602
#define P2DC3                         603
#define P2DC4                         604
#define P2DC5                         605
#define P2DC6                         606
#define P2RSEN                        607
#define CCP2AS                        608
#define PSS2BD0                       609
#define PSS2BD1                       610
#define PSS2AC0                       611
#define PSS2AC1                       612
#define CCP2AS0                       613
#define CCP2AS1                       614
#define CCP2AS2                       615
#define CCP2ASE                       616
#define PSTR2CON                      617
#define STR2A                         618
#define STR2B                         619
#define STR2C                         620
#define STR2D                         621
#define STR2SYNC                      622
#define CCPTMRS0                      623
#define C1TSEL0                       624
#define C1TSEL                        625
#define C1TSEL1                       626
#define C2TSEL0                       627
#define C2TSEL                        628
#define C2TSEL1                       629
#define C3TSEL0                       630
#define C3TSEL                        631
#define C3TSEL1                       632
#define C4TSEL                        633
#define C4TSEL0                       634
#define C4TSEL1                       635
#define CCPTMRS1                      636
#define C5TSEL                        637
#define C5TSEL0                       638
#define C5TSEL1                       639
#define CCPR3L                        640
#define CCPR3H                        641
#define CCP3CON                       642
#define CCP3M0                        643
#define CCP3M1                        644
#define CCP3M2                        645
#define CCP3M3                        646
#define DC3B0                         647
#define DC3B1                         648
#define P3M0                          649
#define P3M1                          650
#define PWM3CON                       651
#define P3DC0                         652
#define P3DC1                         653
#define P3DC2                         654
#define P3DC3                         655
#define P3DC4                         656
#define P3DC5                         657
#define P3DC6                         658
#define P3RSEN                        659
#define CCP3AS                        660
#define PSS3BD0                       661
#define PSS3BD1                       662
#define PSS3AC0                       663
#define PSS3AC1                       664
#define CCP3AS0                       665
#define CCP3AS1                       666
#define CCP3AS2                       667
#define CCP3ASE                       668
#define PSTR3CON                      669
#define STR3A                         670
#define STR3B                         671
#define STR3C                         672
#define STR3D                         673
#define STR3SYNC                      674
#define CCPR4L                        675
#define CCPR4H                        676
#define CCP4CON                       677
#define CCP4M0                        678
#define CCP4M1                        679
#define CCP4M2                        680
#define CCP4M3                        681
#define DC4B0                         682
#define DC4B1                         683
#define CCPR5L                        684
#define CCPR5H                        685
#define CCP5CON                       686
#define CCP5M0                        687
#define CCP5M1                        688
#define CCP5M2                        689
#define CCP5M3                        690
#define DC5B0                         691
#define DC5B1                         692
#define IOCBP                         693
#define IOCBP0                        694
#define IOCBP1                        695
#define IOCBP2                        696
#define IOCBP3                        697
#define IOCBP4                        698
#define IOCBP5                        699
#define IOCBP6                        700
#define IOCBP7                        701
#define IOCBN0                        702
#define IOCBN                         703
#define IOCBN1                        704
#define IOCBN2                        705
#define IOCBN3                        706
#define IOCBN4                        707
#define IOCBN5                        708
#define IOCBN6                        709
#define IOCBN7                        710
#define IOCBF0                        711
#define IOCBF                         712
#define IOCBF1                        713
#define IOCBF2                        714
#define IOCBF3                        715
#define IOCBF4                        716
#define IOCBF5                        717
#define IOCBF6                        718
#define IOCBF7                        719
#define TMR4                          720
#define PR4                           721
#define T4CON                         722
#define T4CKPS0                       723
#define T4CKPS                        724
#define T4CKPS1                       725
#define TMR4ON                        726
#define T4OUTPS                       727
#define T4OUTPS0                      728
#define T4OUTPS1                      729
#define T4OUTPS2                      730
#define T4OUTPS3                      731
#define TMR6                          732
#define PR6                           733
#define T6CON                         734
#define T6CKPS0                       735
#define T6CKPS                        736
#define T6CKPS1                       737
#define TMR6ON                        738
#define T6OUTPS0                      739
#define T6OUTPS                       740
#define T6OUTPS1                      741
#define T6OUTPS2                      742
#define T6OUTPS3                      743
#define LCDCON                        744
#define LMUX0                         745
#define LMUX                          746
#define LMUX1                         747
#define CS                            748
#define CS0                           749
#define CS1                           750
#define WERR                          751
#define SLPEN                         752
#define LCDEN                         753
#define LCDPS                         754
#define LP                            755
#define LP0                           756
#define LP1                           757
#define LP2                           758
#define LP3                           759
#define WA                            760
#define LCDA                          761
#define BIASMD                        762
#define WFT                           763
#define LCDREF                        764
#define VLCD1PE                       765
#define VLCD2PE                       766
#define VLCD3PE                       767
#define LCDIRI                        768
#define LCDIRS                        769
#define LCDIRE                        770
#define LCDCST0                       771
#define LCDCST                        772
#define LCDCST1                       773
#define LCDCST2                       774
#define LCDRL                         775
#define LRLAT0                        776
#define LRLAT                         777
#define LRLAT1                        778
#define LRLAT2                        779
#define LRLBP                         780
#define LRLBP0                        781
#define LRLBP1                        782
#define LRLAP0                        783
#define LRLAP                         784
#define LRLAP1                        785
#define LCDSE0                        786
#define SE0                           787
#define SE1                           788
#define SE2                           789
#define SE3                           790
#define SE4                           791
#define SE5                           792
#define SE6                           793
#define SE7                           794
#define LCDSE1                        795
#define SE8                           796
#define SE9                           797
#define SE10                          798
#define SE11                          799
#define SE12                          800
#define SE13                          801
#define SE14                          802
#define SE15                          803
#define LCDSE2                        804
#define SE16                          805
#define SE17                          806
#define SE18                          807
#define SE19                          808
#define SE20                          809
#define SE21                          810
#define SE22                          811
#define SE23                          812
#define LCDDATA0                      813
#define SEG0COM0                      814
#define SEG1COM0                      815
#define SEG2COM0                      816
#define SEG3COM0                      817
#define SEG4COM0                      818
#define SEG5COM0                      819
#define SEG6COM0                      820
#define SEG7COM0                      821
#define LCDDATA1                      822
#define SEG8COM0                      823
#define SEG9COM0                      824
#define SEG10COM0                     825
#define SEG11COM0                     826
#define SEG12COM0                     827
#define SEG13COM0                     828
#define SEG14COM0                     829
#define SEG15COM0                     830
#define LCDDATA2                      831
#define SEG16COM0                     832
#define SEG17COM0                     833
#define SEG18COM0                     834
#define SEG19COM0                     835
#define SEG20COM0                     836
#define SEG21COM0                     837
#define SEG22COM0                     838
#define SEG23COM0                     839
#define LCDDATA3                      840
#define SEG0COM1                      841
#define SEG1COM1                      842
#define SEG2COM1                      843
#define SEG3COM1                      844
#define SEG4COM1                      845
#define SEG5COM1                      846
#define SEG6COM1                      847
#define SEG7COM1                      848
#define LCDDATA4                      849
#define SEG8COM1                      850
#define SEG9COM1                      851
#define SEG10COM1                     852
#define SEG11COM1                     853
#define SEG12COM1                     854
#define SEG13COM1                     855
#define SEG14COM1                     856
#define SEG15COM1                     857
#define LCDDATA5                      858
#define SEG16COM1                     859
#define SEG17COM1                     860
#define SEG18COM1                     861
#define SEG19COM1                     862
#define SEG20COM1                     863
#define SEG21COM1                     864
#define SEG22COM1                     865
#define SEG23COM1                     866
#define LCDDATA6                      867
#define SEG0COM2                      868
#define SEG1COM2                      869
#define SEG2COM2                      870
#define SEG3COM2                      871
#define SEG4COM2                      872
#define SEG5COM2                      873
#define SEG6COM2                      874
#define SEG7COM2                      875
#define LCDDATA7                      876
#define SEG8COM2                      877
#define SEG9COM2                      878
#define SEG10COM2                     879
#define SEG11COM2                     880
#define SEG12COM2                     881
#define SEG13COM2                     882
#define SEG14COM2                     883
#define SEG15COM2                     884
#define LCDDATA8                      885
#define SEG16COM2                     886
#define SEG17COM2                     887
#define SEG18COM2                     888
#define SEG19COM2                     889
#define SEG20COM2                     890
#define SEG21COM2                     891
#define SEG22COM2                     892
#define SEG23COM2                     893
#define LCDDATA9                      894
#define SEG0COM3                      895
#define SEG1COM3                      896
#define SEG2COM3                      897
#define SEG3COM3                      898
#define SEG4COM3                      899
#define SEG5COM3                      900
#define SEG6COM3                      901
#define SEG7COM3                      902
#define LCDDATA10                     903
#define SEG8COM3                      904
#define SEG9COM3                      905
#define SEG10COM3                     906
#define SEG11COM3                     907
#define SEG12COM3                     908
#define SEG13COM3                     909
#define SEG14COM3                     910
#define SEG15COM3                     911
#define LCDDATA11                     912
#define SEG16COM3                     913
#define SEG17COM3                     914
#define SEG18COM3                     915
#define SEG19COM3                     916
#define SEG20COM3                     917
#define SEG21COM3                     918
#define SEG22COM3                     919
#define SEG23COM3                     920
#define STATUS_SHAD                   921
#define C_SHAD                        922
#define DC_SHAD                       923
#define Z_SHAD                        924
#define WREG_SHAD                     925
#define BSR_SHAD                      926
#define PCLATH_SHAD                   927
#define FSR0L_SHAD                    928
#define FSR0H_SHAD                    929
#define FSR1L_SHAD                    930
#define FSR1H_SHAD                    931
#define STKPTR                        932
#define TOSL                          933
#define TOSH                          934

#endif // _PIC16F1939_H_
